app/controllers/examples_controller.rb

SELECT "examples".* FROM "examples"
---
  def index
    @examples = Example.all

SELECT  "examples".* FROM "examples" WHERE "examples"."id" = ? LIMIT 1  [["id", 3]]
---
  def show
    @example = Example.find_by(id: params[:id])

SELECT  "examples".* FROM "examples" WHERE "examples"."id" = ? LIMIT 1  [["id", 7]]
---
  def edit
    @example = Example.find_by(id: params[:id])

INSERT INTO "examples" ("name", "design", "album", "pageview", "like") VALUES (?, ?, ?, ?, ?)  [["name", "example5"], ["design", "simple"], ["album", "standard"], ["pageview", 2000], ["like", 400]]
---
  def create
    @example = Example.new
    @example.name = params["example"]["name"]
    @example.design = params["example"]["design"]
    @example.album = params["example"]["album"]
    @example.pageview = params["example"]["pageview"]
    @example.like = params["example"]["like"]

    if @example.save

SELECT  "examples".* FROM "examples" WHERE "examples"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "examples" SET "design" = ?, "album" = ?, "like" = ? WHERE "examples"."id" = ?  [["design", "シンプル"], ["album", "Standard"], ["like", 4], ["id", 6]]
---
  def update
    @example = Example.find_by(id: params[:id])
    @example.assign_attributes(params[:example])

    if @example.save

SELECT  "examples".* FROM "examples" WHERE "examples"."id" = ? LIMIT 1  [["id", 18]]
DELETE FROM "examples" WHERE "examples"."id" = ?  [["id", 18]]
---
  def destroy
    @example = Example.find_by(id: params[:id])
    @example.destroy