app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "dummy@dummy.dummy"]]
---
  def create
    the_user = User.find_by(email: params[:email])