app/controllers/users_controller.rb

  def create
    user = User.new
    user.name = params[:user][:name]
    user.email = params[:user][:email]
    user.password = params[:user][:password]
    user.save
---
INSERT INTO "users" ("name", "email", "password_digest") VALUES (?, ?, ?)  [["name", "Yoshio"], ["email", "yoshio.yasuoka@gmail.com"], ["password_digest", "$2a$10$PkFpystChmyTsvMp5SQheuCgaRmbLcagb1HggJEUHgU.XwK/ZvFAa"]]